--------------------------------------------------------------------------------
      name:  ckn06_desc01_PewJune2020
       log:  /Users/mollymking/Documents/SocResearch/COVID_Knowledge_News/covid_
> knowledge_news/stata/ckn06_desc01_PewJune2020.log
  log type:  text
 opened on:  17 Jun 2021, 12:52:07

. ***-----------------------------***
. 
. //      project:        Knowledge of COVID & News Sources
. //  task:       Descriptive Statistics - June Knowledge Questions
. /*  data:    */ di "`dataset'"
01_PewJune2020

. 
. //  github:     covid_knowledge_news
. //  OSF:                https://osf.io/qf624/
. 
. //  author:     Molly King
. 
. display "$S_DATE  $S_TIME"
17 Jun 2021  12:52:07

. 
. ***--------------------------***
. // # PROGRAM SETUP
. ***-----------------------------***
. 
. version 16 // keeps program consistent for future replications

. set linesize 80

. clear all

. set more off

. 
. capture net install desctable, from("https://tdmize.github.io/data/desctable")

. 
. use  $deriv/ckn05_news`dataset'.dta, clear
(01_PewJune2020 Knowledge variables)

. save $deriv/ckn`category'`dataset'.dta, replace // data that results at end
file ~/Documents/SocResearch/COVID_Knowledge_News/data/data_derv/ckn06_desc01_Pe
> wJune2020.dta saved

. 
. ***-----------------------------***
. // # ANALYTICAL DATASET
. ***-----------------------------***
. 
. drop if fauci_c == .
(0 observations deleted)

. drop if stateresponse_c == .
(0 observations deleted)

. drop if antibody_c == .
(0 observations deleted)

. 
. drop if dG_cnews == .
(383 observations deleted)

. 
. 
. drop if dG_race == .
(115 observations deleted)

. drop if dG_age == .
(35 observations deleted)

. drop if dG_edu3 == .
(13 observations deleted)

. *drop if dG_pol == .
. drop if dB_fem == .
(6 observations deleted)

. drop if dG_relig == .
(86 observations deleted)

. drop if dG_finc == . 
(320 observations deleted)

. drop if dG_newsfol == .
(28 observations deleted)

. 
. save $deriv/ckn`category'`dataset'.dta, replace // data that results at end
file ~/Documents/SocResearch/COVID_Knowledge_News/data/data_derv/ckn06_desc01_Pe
> wJune2020.dta saved

. 
. ***-----------------------------***
. // # DESCRIPTIVES
. ***-----------------------------***
. 
. local demographics "dB_rwhite dB_rblack dB_rasian dB_rhisp dB_rother dB_age_18
> _29 dB_age_30_49 dB_age_50_64 dB_age_65p dB_inc_l30k dB_inc_30_50k dB_inc_50_7
> 5k dB_inc_75_100k dB_inc_100_150k dB_inc_150kp dB_fem dB_edu_HSl dB_edu_sCol d
> B_edu_colp dB_cnews_natl dB_cnews_local dB_cnews_politicians dB_cnews_pubhealt
> h dB_cnews_informal dB_newsfol_vc dB_newsfol_fc dB_newsfol_n dB_rel_conP  dB_r
> el_libP  dB_rel_cath  dB_rel_oth  dB_rel_none"

. 
. 
. local income_var "dG_finc"      

. local edu_var "dG_edu3"

. local dem_categories  "dG_cnews  dG_newsfol dG_age dB_fem  dG_race `income_var
> '  `edu_var' dG_rel"

. 
. * age, gender, race and ethnicity, family income, education, and religion. 
. * full sample
.         desctable i.dG_cnews i.dG_newsfol ///
>                 i.dG_race i.dG_age  i.`income_var' dB_fem  i.`edu_var' i.dG_re
> l, ///
>                 stats(svymean) ///
>                 filename($results/ckn`category'`dataset') ///
>                 sheetname(all)
.

Descriptive statistics table has been saved in the folder:
/Users/mollymking/Documents/SocResearch/COVID_Knowledge_News/data/data_derv

. 
. foreach dem_var of local demographics {
  2.         svy: mean `dem_var'
  3. }
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
   dB_rwhite |   .6607084   .0085199      .6440072    .6774095
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
   dB_rblack |   .1059587   .0057816      .0946253     .117292
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
   dB_rasian |   .0528812   .0044968      .0440663     .061696
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
    dB_rhisp |   .1532438   .0066693      .1401705    .1663172
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
   dB_rother |    .027208    .002727      .0218625    .0325535
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
dB_age_18_29 |   .1887407   .0079509       .173155    .2043265
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
dB_age_30_49 |   .3426739   .0080138      .3269649    .3583829
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
dB_age_50_64 |   .2608853   .0070472      .2470711    .2746994
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
  dB_age_65p |   .2077001   .0063125      .1953262     .220074
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 dB_inc_l30k |   .2907089   .0087277      .2736006    .3078172
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1         Number of obs   =      8,668
Number of PSUs   =   8,668         Population size = 8,450.6293
                                   Design df       =      8,667

---------------------------------------------------------------
              |             Linearized
              |       Mean   Std. Err.     [95% Conf. Interval]
--------------+------------------------------------------------
dB_inc_30_50k |   .1963304   .0070484      .1825139    .2101469
---------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1         Number of obs   =      8,668
Number of PSUs   =   8,668         Population size = 8,450.6293
                                   Design df       =      8,667

---------------------------------------------------------------
              |             Linearized
              |       Mean   Std. Err.     [95% Conf. Interval]
--------------+------------------------------------------------
dB_inc_50_75k |   .1657044   .0059321      .1540762    .1773327
---------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1          Number of obs   =      8,668
Number of PSUs   =   8,668          Population size = 8,450.6293
                                    Design df       =      8,667

----------------------------------------------------------------
               |             Linearized
               |       Mean   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
dB_inc_75_100k |    .123689   .0048616      .1141592    .1332188
----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1           Number of obs   =      8,668
Number of PSUs   =   8,668           Population size = 8,450.6293
                                     Design df       =      8,667

-----------------------------------------------------------------
                |             Linearized
                |       Mean   Std. Err.     [95% Conf. Interval]
----------------+------------------------------------------------
dB_inc_100_150k |   .1242732   .0045113        .11543    .1331163
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
dB_inc_150kp |   .0992942   .0039567      .0915382    .1070502
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
      dB_fem |   .5175273   .0085421      .5007828    .5342718
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
  dB_edu_HSl |   .3489663   .0093342      .3306691    .3672635
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 dB_edu_sCol |   .3169804   .0076553      .3019741    .3319867
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 dB_edu_colp |   .3340533   .0067108      .3208986    .3472081
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1         Number of obs   =      8,668
Number of PSUs   =   8,668         Population size = 8,450.6293
                                   Design df       =      8,667

---------------------------------------------------------------
              |             Linearized
              |       Mean   Std. Err.     [95% Conf. Interval]
--------------+------------------------------------------------
dB_cnews_natl |   .3109951   .0076112      .2960754    .3259148
---------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1          Number of obs   =      8,668
Number of PSUs   =   8,668          Population size = 8,450.6293
                                    Design df       =      8,667

----------------------------------------------------------------
               |             Linearized
               |       Mean   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
dB_cnews_local |   .1733296   .0068587       .159885    .1867742
----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1                Number of obs   =      8,668
Number of PSUs   =   8,668                Population size = 8,450.6293
                                          Design df       =      8,667

----------------------------------------------------------------------
                     |             Linearized
                     |       Mean   Std. Err.     [95% Conf. Interval]
---------------------+------------------------------------------------
dB_cnews_politicians |   .2499629   .0072582      .2357351    .2641907
----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1              Number of obs   =      8,668
Number of PSUs   =   8,668              Population size = 8,450.6293
                                        Design df       =      8,667

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   Std. Err.     [95% Conf. Interval]
-------------------+------------------------------------------------
dB_cnews_pubhealth |   .1807644   .0062003      .1686102    .1929185
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1             Number of obs   =      8,668
Number of PSUs   =   8,668             Population size = 8,450.6293
                                       Design df       =      8,667

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   Std. Err.     [95% Conf. Interval]
------------------+------------------------------------------------
dB_cnews_informal |    .084948   .0057962       .073586      .09631
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1         Number of obs   =      8,668
Number of PSUs   =   8,668         Population size = 8,450.6293
                                   Design df       =      8,667

---------------------------------------------------------------
              |             Linearized
              |       Mean   Std. Err.     [95% Conf. Interval]
--------------+------------------------------------------------
dB_newsfol_vc |   .4043329   .0081352      .3883861    .4202798
---------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1         Number of obs   =      8,668
Number of PSUs   =   8,668         Population size = 8,450.6293
                                   Design df       =      8,667

---------------------------------------------------------------
              |             Linearized
              |       Mean   Std. Err.     [95% Conf. Interval]
--------------+------------------------------------------------
dB_newsfol_fc |   .4629934   .0085022      .4463271    .4796597
---------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
dB_newsfol_n |   .1326737   .0067805      .1193824     .145965
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 dB_rel_conP |    .229144   .0071231      .2151811    .2431069
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 dB_rel_libP |   .1520762   .0057276      .1408487    .1633037
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 dB_rel_cath |   .1881236   .0064621      .1754564    .2007907
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
  dB_rel_oth |   .0795118   .0043846      .0709169    .0881067
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      8,668
Number of PSUs   =   8,668        Population size = 8,450.6293
                                  Design df       =      8,667

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 dB_rel_none |   .3511444   .0083828      .3347121    .3675768
--------------------------------------------------------------

. 
end of do-file

. exit
