--------------------------------------------------------------------------------
      name:  ckn04_inc01_PewJune2020
       log:  /Users/mmking/Documents/SocResearch/COVID_Knowledge_News/covid_know
> ledge_news/stata/ckn04_inc01_PewJune2020.log
  log type:  text
 opened on:  20 Mar 2023, 13:13:56

. ***--------------------------***
. 
. //      project:        Knowledge of COVID & News Sources
. //  task:       Income variables
. //  data:       di "`dataset'"
. 
. //  github:     covid_knowledge_news
. //  OSF:                https://osf.io/qf624/
. 
. //  author:     Molly King
. 
. display "$S_DATE  $S_TIME"
20 Mar 2023  13:13:56

. 
. ***-----------------------------***
. // # PROGRAM SETUP
. ***-----------------------------***
. 
. version 16 // keeps program consistent for future replications

. set linesize 80

. clear all

. set more off

. 
. use $deriv/ckn03_know`dataset'.dta, clear
(01_PewJune2020 Knowledge variables)

. save $deriv/ckn`category'`dataset'.dta, replace // data that results at end
file ~/Documents/SocResearch/COVID_Knowledge_News/data/data_derv/ckn04_inc01_Pew
> June2020.dta saved

. 
. ***-----------------------------***
. // # COMBINE INCOME CATEGORIES FOR ONE BIG CATEGORY VARIABLE
. ***-----------------------------***
. 
. // USE OLD INCOME VARIABLE LABEL TO CREATE NEW VARIABLE LABEL
. *label list
. codebook f_income

--------------------------------------------------------------------------------
f_income                                                           Family income
--------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  labels131

                 range:  [1,99]                       units:  1
         unique values:  10                       missing .:  0/9,654

              examples:  4     $30,000 to less than $40,000
                         6     $50,000 to less than $75,000
                         7     $75,000 to less than $100,000
                         8     $100,000 to less than $150,000

. *income uses value label X
. uselabel labels82, clear // takes label and converts it into data table

. // then can copy this and use it for creating new more robust data label for n
> ew variables
. 
. use $deriv/ckn`category'`dataset'.dta, clear
(01_PewJune2020 Knowledge variables)

. 
. label define inc_categories_`dataset' ///
>         1       "Less than 10,000" ///
>         2       "10,000 to less than 20,000" ///
>         3       "20,000 to less than 30,000" ///
>         4       "30,000 to less than 40,000" ///
>         5       "40,000 to less than 50,000" ///
>         6       "50,000 to less than 75,000" ///
>         7       "75,000 to less than 100,000" ///
>         8       "100,000 to less than 150,000" ///
>         9       "150,000 or more" ///
>         99      "Refused" 

. 
. 
. ***-----------------------------***
. // CREATE FAMILY INCOME VARIABLE
. 
. local family_income_variable f_income

. 
. tab `family_income_variable', m

                 Family income |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
             Less than $10,000 |        384        3.98        3.98
  $10,000 to less than $20,000 |        579        6.00        9.98
  $20,000 to less than $30,000 |        708        7.33       17.31
  $30,000 to less than $40,000 |        729        7.55       24.86
  $40,000 to less than $50,000 |        795        8.23       33.10
  $50,000 to less than $75,000 |      1,644       17.03       50.12
 $75,000 to less than $100,000 |      1,393       14.43       64.55
$100,000 to less than $150,000 |      1,610       16.68       81.23
              $150,000 or more |      1,406       14.56       95.79
                       Refused |        406        4.21      100.00
-------------------------------+-----------------------------------
                         Total |      9,654      100.00

. tab `family_income_variable', m nolab

     Family |
     income |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        384        3.98        3.98
          2 |        579        6.00        9.98
          3 |        708        7.33       17.31
          4 |        729        7.55       24.86
          5 |        795        8.23       33.10
          6 |      1,644       17.03       50.12
          7 |      1,393       14.43       64.55
          8 |      1,610       16.68       81.23
          9 |      1,406       14.56       95.79
         99 |        406        4.21      100.00
------------+-----------------------------------
      Total |      9,654      100.00

. 
. clonevar dL_finc = `family_income_variable'

. 
. *check if coded correctly
. tab dL_finc `family_income_variable', m

                      |                Family income
        Family income | Less than  $10,000 t  $20,000 t  $30,000 t |     Total
----------------------+--------------------------------------------+----------
    Less than $10,000 |       384          0          0          0 |       384 
$10,000 to less than  |         0        579          0          0 |       579 
$20,000 to less than  |         0          0        708          0 |       708 
$30,000 to less than  |         0          0          0        729 |       729 
$40,000 to less than  |         0          0          0          0 |       795 
$50,000 to less than  |         0          0          0          0 |     1,644 
$75,000 to less than  |         0          0          0          0 |     1,393 
$100,000 to less than |         0          0          0          0 |     1,610 
     $150,000 or more |         0          0          0          0 |     1,406 
              Refused |         0          0          0          0 |       406 
----------------------+--------------------------------------------+----------
                Total |       384        579        708        729 |     9,654 


                      |                Family income
        Family income | $40,000 t  $50,000 t  $75,000 t  $100,000  |     Total
----------------------+--------------------------------------------+----------
    Less than $10,000 |         0          0          0          0 |       384 
$10,000 to less than  |         0          0          0          0 |       579 
$20,000 to less than  |         0          0          0          0 |       708 
$30,000 to less than  |         0          0          0          0 |       729 
$40,000 to less than  |       795          0          0          0 |       795 
$50,000 to less than  |         0      1,644          0          0 |     1,644 
$75,000 to less than  |         0          0      1,393          0 |     1,393 
$100,000 to less than |         0          0          0      1,610 |     1,610 
     $150,000 or more |         0          0          0          0 |     1,406 
              Refused |         0          0          0          0 |       406 
----------------------+--------------------------------------------+----------
                Total |       795      1,644      1,393      1,610 |     9,654 


                      |     Family income
        Family income | $150,000     Refused |     Total
----------------------+----------------------+----------
    Less than $10,000 |         0          0 |       384 
$10,000 to less than  |         0          0 |       579 
$20,000 to less than  |         0          0 |       708 
$30,000 to less than  |         0          0 |       729 
$40,000 to less than  |         0          0 |       795 
$50,000 to less than  |         0          0 |     1,644 
$75,000 to less than  |         0          0 |     1,393 
$100,000 to less than |         0          0 |     1,610 
     $150,000 or more |     1,406          0 |     1,406 
              Refused |         0        406 |       406 
----------------------+----------------------+----------
                Total |     1,406        406 |     9,654 

. tab dL_finc `family_income_variable', m

                      |                Family income
        Family income | Less than  $10,000 t  $20,000 t  $30,000 t |     Total
----------------------+--------------------------------------------+----------
    Less than $10,000 |       384          0          0          0 |       384 
$10,000 to less than  |         0        579          0          0 |       579 
$20,000 to less than  |         0          0        708          0 |       708 
$30,000 to less than  |         0          0          0        729 |       729 
$40,000 to less than  |         0          0          0          0 |       795 
$50,000 to less than  |         0          0          0          0 |     1,644 
$75,000 to less than  |         0          0          0          0 |     1,393 
$100,000 to less than |         0          0          0          0 |     1,610 
     $150,000 or more |         0          0          0          0 |     1,406 
              Refused |         0          0          0          0 |       406 
----------------------+--------------------------------------------+----------
                Total |       384        579        708        729 |     9,654 


                      |                Family income
        Family income | $40,000 t  $50,000 t  $75,000 t  $100,000  |     Total
----------------------+--------------------------------------------+----------
    Less than $10,000 |         0          0          0          0 |       384 
$10,000 to less than  |         0          0          0          0 |       579 
$20,000 to less than  |         0          0          0          0 |       708 
$30,000 to less than  |         0          0          0          0 |       729 
$40,000 to less than  |       795          0          0          0 |       795 
$50,000 to less than  |         0      1,644          0          0 |     1,644 
$75,000 to less than  |         0          0      1,393          0 |     1,393 
$100,000 to less than |         0          0          0      1,610 |     1,610 
     $150,000 or more |         0          0          0          0 |     1,406 
              Refused |         0          0          0          0 |       406 
----------------------+--------------------------------------------+----------
                Total |       795      1,644      1,393      1,610 |     9,654 


                      |     Family income
        Family income | $150,000     Refused |     Total
----------------------+----------------------+----------
    Less than $10,000 |         0          0 |       384 
$10,000 to less than  |         0          0 |       579 
$20,000 to less than  |         0          0 |       708 
$30,000 to less than  |         0          0 |       729 
$40,000 to less than  |         0          0 |       795 
$50,000 to less than  |         0          0 |     1,644 
$75,000 to less than  |         0          0 |     1,393 
$100,000 to less than |         0          0 |     1,610 
     $150,000 or more |     1,406          0 |     1,406 
              Refused |         0        406 |       406 
----------------------+----------------------+----------
                Total |     1,406        406 |     9,654 

. 
. recode dL_finc 99 = .n //       Don't Know/refused
(dL_finc: 406 changes made)

. 
. label var dL_finc "family Income"

. lab val dL_finc inc_categories_`dataset'

. notes dL_finc:`dataset' Family Income Categories from `family_income_variable'
>  \ ckn`category'`dataset'.do mmk $S_DATE

. 
. 
. ***-----------------------------***
. // CREATE FAMILY INCOME VARIABLE - LARGER CATEGORIES
. 
. tab dL_finc f_income_recode, m

                      |            Family income recoded
        family Income |  $75,000+  $30-$74,9   <$30,000    Refused |     Total
----------------------+--------------------------------------------+----------
     Less than 10,000 |         0          0        384          0 |       384 
10,000 to less than 2 |         0          0        579          0 |       579 
20,000 to less than 3 |         0          0        708          0 |       708 
30,000 to less than 4 |         0        729          0          0 |       729 
40,000 to less than 5 |         0        795          0          0 |       795 
50,000 to less than 7 |         0      1,644          0          0 |     1,644 
75,000 to less than 1 |     1,393          0          0          0 |     1,393 
100,000 to less than  |     1,610          0          0          0 |     1,610 
      150,000 or more |     1,406          0          0          0 |     1,406 
                   .n |         0          0          0        406 |       406 
----------------------+--------------------------------------------+----------
                Total |     4,409      3,168      1,671        406 |     9,654 

. 
. label define inc_categories_broader ///
>         1       "Less than 30,000" ///
>         2       "30,000 to to less than 50,000" ///
>         3       "50,000 to less than 75,000" ///
>         4       "75,000 to less than 100,000" ///
>         5       "100,000 to less than 150,000" ///
>         6       "150,000 or more" ///
>         .n      "Refused" 

. 
. gen             dG_finc = .
(9,654 missing values generated)

. replace dG_finc = 1 if dL_finc == 1 | dL_finc == 2 | dL_finc == 3
(1,671 real changes made)

. replace dG_finc = 2 if dL_finc == 4 | dL_finc == 5
(1,524 real changes made)

. replace dG_finc = 3 if dL_finc == 6
(1,644 real changes made)

. replace dG_finc = 4 if dL_finc == 7
(1,393 real changes made)

. replace dG_finc = 5 if dL_finc == 8
(1,610 real changes made)

. replace dG_finc = 6 if dL_finc == 9
(1,406 real changes made)

. replace dG_finc = . if dL_finc == .n
(0 real changes made)

. 
. 
. label var dG_finc "family Income - categories more than 1000 respondents"

. lab val dG_finc inc_categories_broader

. notes dG_finc:`dataset' Family Income Categories from `family_income_variable'
>  \ ckn`category'`dataset'.do mmk $S_DATE

. 
. tab f_income dG_finc, m

                      |  family Income - categories more than 1000
                      |                 respondents
        Family income | Less than  30,000 to  50,000 to  75,000 to |     Total
----------------------+--------------------------------------------+----------
    Less than $10,000 |       384          0          0          0 |       384 
$10,000 to less than  |       579          0          0          0 |       579 
$20,000 to less than  |       708          0          0          0 |       708 
$30,000 to less than  |         0        729          0          0 |       729 
$40,000 to less than  |         0        795          0          0 |       795 
$50,000 to less than  |         0          0      1,644          0 |     1,644 
$75,000 to less than  |         0          0          0      1,393 |     1,393 
$100,000 to less than |         0          0          0          0 |     1,610 
     $150,000 or more |         0          0          0          0 |     1,406 
              Refused |         0          0          0          0 |       406 
----------------------+--------------------------------------------+----------
                Total |     1,671      1,524      1,644      1,393 |     9,654 


                      | family Income - categories more
                      |      than 1000 respondents
        Family income | 100,000 t  150,000 o          . |     Total
----------------------+---------------------------------+----------
    Less than $10,000 |         0          0          0 |       384 
$10,000 to less than  |         0          0          0 |       579 
$20,000 to less than  |         0          0          0 |       708 
$30,000 to less than  |         0          0          0 |       729 
$40,000 to less than  |         0          0          0 |       795 
$50,000 to less than  |         0          0          0 |     1,644 
$75,000 to less than  |         0          0          0 |     1,393 
$100,000 to less than |     1,610          0          0 |     1,610 
     $150,000 or more |         0      1,406          0 |     1,406 
              Refused |         0          0        406 |       406 
----------------------+---------------------------------+----------
                Total |     1,610      1,406        406 |     9,654 

. 
. // Binary Income Categories
. 
. local inc_var dG_finc

. tab `inc_var', m nolab

     family |
   Income - |
 categories |
  more than |
       1000 |
respondents |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,671       17.31       17.31
          2 |      1,524       15.79       33.10
          3 |      1,644       17.03       50.12
          4 |      1,393       14.43       64.55
          5 |      1,610       16.68       81.23
          6 |      1,406       14.56       95.79
          . |        406        4.21      100.00
------------+-----------------------------------
      Total |      9,654      100.00

. 
. *refused code(s) for `inc_var'
. local inc_missing_condition `"`inc_var' == .n"' //Refused

. 
. local incl30k_condition         `"`inc_var' == 1"' //   

. local inc30_50k_condition       `"`inc_var' == 2"' //   

. local inc50_75k_condition       `"`inc_var' == 3"'      // 

. local inc75_100k_condition      `"`inc_var' == 4"'      // 

. local inc100_150k_condition `"`inc_var' == 5"'  // 

. local inc150kp_condition        `"`inc_var' == 6"'      // 

. 
. local inclist "l30k 30_50k 50_75k 75_100k 100_150k 150kp"

. foreach inc of local inclist {
  2.         gen dB_inc_`inc' = 0
  3.         // Replace each with . for missing 
.                 if "`inc_missing_condition'" != "none" {
  4.                         replace dB_inc_`inc' = . if `inc_missing_condition'
  5.                 }
  6.         label var dB_inc_`inc' "Inc category `inc'"
  7.         label define dB_inc_`inc' 0 "Not `inc'" 1 "`inc'"
  8.                 label val dB_inc_`inc' dB_inc_`inc'
  9.         notes dB_inc_`inc': Income category `inc'. created from `inc_var' v
> ariable in `dataset' \ ckn`category'`dataset'.do mmk $S_DATE
 10. 
.         replace dB_inc_`inc' = 1 if `inc`inc'_condition'
 11. }
(0 real changes made)
(1,671 real changes made)
(0 real changes made)
(1,524 real changes made)
(0 real changes made)
(1,644 real changes made)
(0 real changes made)
(1,393 real changes made)
(0 real changes made)
(1,610 real changes made)
(0 real changes made)
(1,406 real changes made)

. 
. tab `inc_var' dG_finc, m

      family Income - |  family Income - categories more than 1000
 categories more than |                 respondents
     1000 respondents | Less than  30,000 to  50,000 to  75,000 to |     Total
----------------------+--------------------------------------------+----------
     Less than 30,000 |     1,671          0          0          0 |     1,671 
30,000 to to less tha |         0      1,524          0          0 |     1,524 
50,000 to less than 7 |         0          0      1,644          0 |     1,644 
75,000 to less than 1 |         0          0          0      1,393 |     1,393 
100,000 to less than  |         0          0          0          0 |     1,610 
      150,000 or more |         0          0          0          0 |     1,406 
                    . |         0          0          0          0 |       406 
----------------------+--------------------------------------------+----------
                Total |     1,671      1,524      1,644      1,393 |     9,654 


      family Income - | family Income - categories more
 categories more than |      than 1000 respondents
     1000 respondents | 100,000 t  150,000 o          . |     Total
----------------------+---------------------------------+----------
     Less than 30,000 |         0          0          0 |     1,671 
30,000 to to less tha |         0          0          0 |     1,524 
50,000 to less than 7 |         0          0          0 |     1,644 
75,000 to less than 1 |         0          0          0 |     1,393 
100,000 to less than  |     1,610          0          0 |     1,610 
      150,000 or more |         0      1,406          0 |     1,406 
                    . |         0          0        406 |       406 
----------------------+---------------------------------+----------
                Total |     1,610      1,406        406 |     9,654 

. tab `inc_var' dB_inc_l30k, m

      family Income - |
 categories more than |   Inc category l30k
     1000 respondents |  Not l30k       l30k |     Total
----------------------+----------------------+----------
     Less than 30,000 |         0      1,671 |     1,671 
30,000 to to less tha |     1,524          0 |     1,524 
50,000 to less than 7 |     1,644          0 |     1,644 
75,000 to less than 1 |     1,393          0 |     1,393 
100,000 to less than  |     1,610          0 |     1,610 
      150,000 or more |     1,406          0 |     1,406 
                    . |       406          0 |       406 
----------------------+----------------------+----------
                Total |     7,983      1,671 |     9,654 

. tab `inc_var' dB_inc_75_100k, m

      family Income - |
 categories more than | Inc category 75_100k
     1000 respondents | Not 75_10    75_100k |     Total
----------------------+----------------------+----------
     Less than 30,000 |     1,671          0 |     1,671 
30,000 to to less tha |     1,524          0 |     1,524 
50,000 to less than 7 |     1,644          0 |     1,644 
75,000 to less than 1 |         0      1,393 |     1,393 
100,000 to less than  |     1,610          0 |     1,610 
      150,000 or more |     1,406          0 |     1,406 
                    . |       406          0 |       406 
----------------------+----------------------+----------
                Total |     8,261      1,393 |     9,654 

. 
. 
. // SAVE
. save $deriv/ckn`category'`dataset'.dta, replace 
file ~/Documents/SocResearch/COVID_Knowledge_News/data/data_derv/ckn04_inc01_Pew
> June2020.dta saved

. 
. ***-----------------------------***
. log close ckn`category'`dataset'
      name:  ckn04_inc01_PewJune2020
       log:  /Users/mmking/Documents/SocResearch/COVID_Knowledge_News/covid_know
> ledge_news/stata/ckn04_inc01_PewJune2020.log
  log type:  text
 closed on:  20 Mar 2023, 13:13:56
--------------------------------------------------------------------------------
